8) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:128    [M] GreaterThan

--- Original
+++ New
@@ @@
             if ($stmt->rowCount() > 0) {
                 return ['success' => false, 'message' => 'El producto ya existe'];
             }
-            if ($files['image']['size'] > 2000000) {
+            if ($files['image']['size'] >= 2000000) {
                 return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
             }
             $stmt = $this->conn->prepare("INSERT INTO `products`(name, price, image) VALUES(?, ?, ?)");

10) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:129    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 return ['success' => false, 'message' => 'El producto ya existe'];
             }
             if ($files['image']['size'] > 2000000) {
-                return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
+                return ['message' => 'El tamaño de la imagen es demasiado grande'];
             }
             $stmt = $this->conn->prepare("INSERT INTO `products`(name, price, image) VALUES(?, ?, ?)");
             if ($stmt->execute([$product->getName(), $product->getPrice(), $product->getImage()])) {

21) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:240    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         try {
             // Validar que los datos no estén vacíos
-            if (empty($postData['update_p_id']) || empty($postData['update_name']) || empty($postData['update_price'])) {
+            if (empty($postData['update_p_id']) && empty($postData['update_name']) || empty($postData['update_price'])) {
                 return ['success' => false, 'message' => 'Datos del producto inválidos'];
             }
             // Validar que el precio sea numérico

22) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:240    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         try {
             // Validar que los datos no estén vacíos
-            if (empty($postData['update_p_id']) || empty($postData['update_name']) || empty($postData['update_price'])) {
+            if ((empty($postData['update_p_id']) || empty($postData['update_name'])) && empty($postData['update_price'])) {
                 return ['success' => false, 'message' => 'Datos del producto inválidos'];
             }
             // Validar que el precio sea numérico

27) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:278    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                 $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
                 $newImageName = uniqid() . '.' . $extension;
                 $product->setImage($newImageName);
-                // Subir nueva imagen
-                move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH . $newImageName);
+                
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ?, image = ? WHERE id = ?");
                 $params = [$product->getName(), $product->getPrice(), $product->getImage(), $product->getId()];
             } else {

28) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:280    [M] Concat

--- Original
+++ New
@@ @@
                 $newImageName = uniqid() . '.' . $extension;
                 $product->setImage($newImageName);
                 // Subir nueva imagen
-                move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH . $newImageName);
+                move_uploaded_file($files['update_image']['tmp_name'], $newImageName . self::UPLOAD_PATH);
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ?, image = ? WHERE id = ?");
                 $params = [$product->getName(), $product->getPrice(), $product->getImage(), $product->getId()];
             } else {

29) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:280    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $newImageName = uniqid() . '.' . $extension;
                 $product->setImage($newImageName);
                 // Subir nueva imagen
-                move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH . $newImageName);
+                move_uploaded_file($files['update_image']['tmp_name'], $newImageName);
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ?, image = ? WHERE id = ?");
                 $params = [$product->getName(), $product->getPrice(), $product->getImage(), $product->getId()];
             } else {

30) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:280    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $newImageName = uniqid() . '.' . $extension;
                 $product->setImage($newImageName);
                 // Subir nueva imagen
-                move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH . $newImageName);
+                move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH);
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ?, image = ? WHERE id = ?");
                 $params = [$product->getName(), $product->getPrice(), $product->getImage(), $product->getId()];
             } else {

31) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:284    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 // Subir nueva imagen
                 move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH . $newImageName);
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ?, image = ? WHERE id = ?");
-                $params = [$product->getName(), $product->getPrice(), $product->getImage(), $product->getId()];
+                $params = [$product->getPrice(), $product->getImage(), $product->getId()];
             } else {
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ? WHERE id = ?");
                 $params = [$product->getName(), $product->getPrice(), $product->getId()];

32) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:287    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $params = [$product->getName(), $product->getPrice(), $product->getImage(), $product->getId()];
             } else {
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ? WHERE id = ?");
-                $params = [$product->getName(), $product->getPrice(), $product->getId()];
+                $params = [$product->getPrice(), $product->getId()];
             }
             if ($stmt->execute($params)) {
                 return ['success' => true, 'message' => 'Producto actualizado exitosamente'];

33) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:296    [M] Concat

--- Original
+++ New
@@ @@
             }
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         } catch (\Exception $e) {
-            error_log("Error al actualizar producto: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al actualizar producto: ");
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         }
     }

36) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:296    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             }
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         } catch (\Exception $e) {
-            error_log("Error al actualizar producto: " . $e->getMessage());
+            
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         }
     }

37) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:297    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         } catch (\Exception $e) {
             error_log("Error al actualizar producto: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al actualizar el producto'];
+            return ['message' => 'Error al actualizar el producto'];
         }
     }
     public function getAllProducts()

38) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:298    [M] FalseValue

--- Original
+++ New
@@ @@
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         } catch (\Exception $e) {
             error_log("Error al actualizar producto: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al actualizar el producto'];
+            return ['success' => true, 'message' => 'Error al actualizar el producto'];
         }
     }
     public function getAllProducts()

48) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ContactController.php:58    [M] Concat

--- Original
+++ New
@@ @@
                 return ['success' => true, 'message' => '¡Mensaje enviado exitosamente!'];
             }
             // Añadir log específico si save() falla
-            error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
+            error_log($userData['user_id'] . "Error en save(): Falló al guardar el mensaje para usuario ID: ");
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());

50) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ContactController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 return ['success' => true, 'message' => '¡Mensaje enviado exitosamente!'];
             }
             // Añadir log específico si save() falla
-            error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
+            error_log("Error en save(): Falló al guardar el mensaje para usuario ID: ");
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());

51) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ContactController.php:58    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             if ($message->save($this->conn)) {
                 return ['success' => true, 'message' => '¡Mensaje enviado exitosamente!'];
             }
-            // Añadir log específico si save() falla
-            error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
+            
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());

52) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ContactController.php:61    [M] Concat

--- Original
+++ New
@@ @@
             error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
-            error_log("Error al enviar mensaje: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al enviar mensaje: ");
             return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
         }
     }
 }

54) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ContactController.php:61    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
-            error_log("Error al enviar mensaje: " . $e->getMessage());
+            error_log("Error al enviar mensaje: ");
             return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
         }
     }
 }

56) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ContactController.php:62    [M] Concat

--- Original
+++ New
@@ @@
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
+            return ['success' => false, 'message' => $e->getMessage() . 'Error al enviar mensaje: '];
         }
     }
 }

57) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ContactController.php:62    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
+            return ['success' => false, 'message' => 'Error al enviar mensaje: '];
         }
     }
 }

67) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:116    [M] Foreach_

--- Original
+++ New
@@ @@
             // Calcular total y preparar lista de productos
             $cartTotal = 0;
             $products = [];
-            foreach ($cartItems as $item) {
+            foreach (array() as $item) {
                 $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
                 $cartTotal += $item['price'] * $item['quantity'];
             }

68) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:117    [M] Concat

--- Original
+++ New
@@ @@
             $cartTotal = 0;
             $products = [];
             foreach ($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
+                $products[] = ' (' . $item['name'] . $item['quantity'] . ')';
                 $cartTotal += $item['price'] * $item['quantity'];
             }
             $totalProducts = implode(', ', $products);

69) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:117    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $cartTotal = 0;
             $products = [];
             foreach ($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
+                $products[] = ' (' . $item['quantity'] . ')';
                 $cartTotal += $item['price'] * $item['quantity'];
             }
             $totalProducts = implode(', ', $products);

70) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:117    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $cartTotal = 0;
             $products = [];
             foreach ($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
+                $products[] = $item['name'] . $item['quantity'] . ')';
                 $cartTotal += $item['price'] * $item['quantity'];
             }
             $totalProducts = implode(', ', $products);

75) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . $userData['city'] . ', ' . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

76) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

77) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . ', ' . $userData['city'] . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

78) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

79) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . $userData['country'] . ', ' . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

80) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

81) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . ' - ' . $userData['country'] . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

82) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

83) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . $userData['pin_code'] . ' - ';
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

84) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:123    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ';
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

85) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:130    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
             $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
-            // Establecer valores adicionales en el objeto Order
-            $order->setAddress($address);
+            
             $order->setTotalProducts($totalProducts);
             $order->setTotalPrice($cartTotal);
             // Verificar si la orden ya existe

88) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:140    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $order->setTotalPrice($cartTotal);
             // Verificar si la orden ya existe
             $stmt = $this->conn->prepare("SELECT * FROM orders WHERE \r\n                name = ? AND number = ? AND email = ? AND \r\n                method = ? AND address = ? AND \r\n                total_products = ? AND total_price = ?");
-            $stmt->execute([$order->getName(), $order->getNumber(), $order->getEmail(), $order->getMethod(), $order->getAddress(), $order->getTotalProducts(), $order->getTotalPrice()]);
+            $stmt->execute([$order->getNumber(), $order->getEmail(), $order->getMethod(), $order->getAddress(), $order->getTotalProducts(), $order->getTotalPrice()]);
             if ($stmt->rowCount() > 0) {
                 return ['success' => false, 'message' => '¡Pedido ya realizado!'];
             }

89) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:160    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             // Insertar nueva orden
             $stmt = $this->conn->prepare("INSERT INTO orders \r\n                (user_id, name, number, email, method, address, \r\n                total_products, total_price, placed_on) \r\n                VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)");
-            $stmt->execute([$order->getUserId(), $order->getName(), $order->getNumber(), $order->getEmail(), $order->getMethod(), $order->getAddress(), $order->getTotalProducts(), $order->getTotalPrice(), date('d-M-Y')]);
+            $stmt->execute([$order->getName(), $order->getNumber(), $order->getEmail(), $order->getMethod(), $order->getAddress(), $order->getTotalProducts(), $order->getTotalPrice(), date('d-M-Y')]);
             // Limpiar carrito
             $this->clearCart($userId);
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];

94) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:214    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             return $orders;
         } catch (\Exception $e) {
-            error_log("Error al obtener órdenes del usuario: " . $e->getMessage());
+            error_log("Error al obtener órdenes del usuario: ");
             return [];
         }
     }

95) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:214    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             }
             return $orders;
         } catch (\Exception $e) {
-            error_log("Error al obtener órdenes del usuario: " . $e->getMessage());
+            
             return [];
         }
     }

97) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:17    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $this->conn = $conn;
     }
-    public function getLatestProducts($limit = 6)
+    public function getLatestProducts($limit = 5)
     {
         try {
             $query = "SELECT * FROM products LIMIT :limit";

98) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:17    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $this->conn = $conn;
     }
-    public function getLatestProducts($limit = 6)
+    public function getLatestProducts($limit = 7)
     {
         try {
             $query = "SELECT * FROM products LIMIT :limit";

103) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:35    [M] Concat

--- Original
+++ New
@@ @@
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener productos: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al obtener productos: ");
             return [];
         }
     }

104) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:35    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener productos: " . $e->getMessage());
+            error_log($e->getMessage());
             return [];
         }
     }
