107) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:62    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             // Añadir al carrito
             $query = "INSERT INTO cart (user_id, name, price, quantity, image) \r\n                     VALUES (?, ?, ?, ?, ?)";
             $stmt = $this->conn->prepare($query);
-            $stmt->execute([$cart->getUserId(), $cart->getName(), $cart->getPrice(), $cart->getQuantity(), $cart->getImage()]);
+            $stmt->execute([$cart->getName(), $cart->getPrice(), $cart->getQuantity(), $cart->getImage()]);
             return ['success' => true, 'message' => 'Producto añadido al carrito'];
         } catch (\Exception $e) {
             error_log("Error al añadir al carrito: " . $e->getMessage());

109) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:72    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$cart->getUserId(), $cart->getName(), $cart->getPrice(), $cart->getQuantity(), $cart->getImage()]);
             return ['success' => true, 'message' => 'Producto añadido al carrito'];
         } catch (\Exception $e) {
-            error_log("Error al añadir al carrito: " . $e->getMessage());
+            error_log($e->getMessage());
             return ['success' => false, 'message' => 'Error al añadir al carrito'];
         }
     }

110) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:72    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$cart->getUserId(), $cart->getName(), $cart->getPrice(), $cart->getQuantity(), $cart->getImage()]);
             return ['success' => true, 'message' => 'Producto añadido al carrito'];
         } catch (\Exception $e) {
-            error_log("Error al añadir al carrito: " . $e->getMessage());
+            error_log("Error al añadir al carrito: ");
             return ['success' => false, 'message' => 'Error al añadir al carrito'];
         }
     }

116) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:94    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener todos los productos: " . $e->getMessage());
+            error_log($e->getMessage());
             return [];
         }
     }

117) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:94    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener todos los productos: " . $e->getMessage());
+            error_log("Error al obtener todos los productos: ");
             return [];
         }
     }

119) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:106    [M] Concat

--- Original
+++ New
@@ @@
             $stmt->execute([$userId]);
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener items del carrito: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al obtener items del carrito: ");
             return [];
         }
     }

120) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:106    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$userId]);
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener items del carrito: " . $e->getMessage());
+            error_log($e->getMessage());
             return [];
         }
     }

123) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:142    [M] Concat

--- Original
+++ New
@@ @@
             $stmt->execute([$userId]);
             return true;
         } catch (\Exception $e) {
-            error_log("Error al eliminar todos los items: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al eliminar todos los items: ");
             return false;
         }
     }
 }

126) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:142    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$userId]);
             return true;
         } catch (\Exception $e) {
-            error_log("Error al eliminar todos los items: " . $e->getMessage());
+            
             return false;
         }
     }
 }

135) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\UserController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$user->getName(), $user->getEmail(), $this->hashPassword($userData['password']), $user->getUserType()]);
             return ['success' => true, 'message' => 'Registro exitoso!'];
         } catch (\Exception $e) {
-            error_log("Error en registro: " . $e->getMessage());
+            error_log("Error en registro: ");
             return ['success' => false, 'message' => 'Error en el registro'];
         }
     }

136) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\UserController.php:51    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$user->getName(), $user->getEmail(), $this->hashPassword($userData['password']), $user->getUserType()]);
             return ['success' => true, 'message' => 'Registro exitoso!'];
         } catch (\Exception $e) {
-            error_log("Error en registro: " . $e->getMessage());
+            
             return ['success' => false, 'message' => 'Error en el registro'];
         }
     }

138) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\UserController.php:72    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
-            error_log("Error en login: " . $e->getMessage());
+            error_log($e->getMessage());
             return ['success' => false, 'message' => 'Error en el inicio de sesión'];
         }
     }

140) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\UserController.php:72    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             }
             return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
-            error_log("Error en login: " . $e->getMessage());
+            
             return ['success' => false, 'message' => 'Error en el inicio de sesión'];
         }
     }

141) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\UserController.php:102    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         try {
             $stmt = $this->conn->prepare("SELECT id, name, email, user_type FROM users WHERE id = ?");
-            $stmt->execute([$userId]);
+            $stmt->execute([]);
             return $stmt->fetch(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
             error_log("Error al obtener usuario: " . $e->getMessage());

144) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\UserController.php:105    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$userId]);
             return $stmt->fetch(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener usuario: " . $e->getMessage());
+            error_log($e->getMessage());
             return null;
         }
     }

146) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\UserController.php:105    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             $stmt->execute([$userId]);
             return $stmt->fetch(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener usuario: " . $e->getMessage());
+            
             return null;
         }
     }

148) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Models\Message.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $sql = "INSERT INTO message (user_id, name, email, number, message) VALUES (?, ?, ?, ?, ?)";
         $stmt = $conn->prepare($sql);
-        return $stmt->execute([$this->userId, $this->name, $this->email, $this->number, $this->message]);
+        return $stmt->execute([$this->name, $this->email, $this->number, $this->message]);
     }
     public function setId($id)
     {

1) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Config\Database.php:13    [M] TrueValue

--- Original
+++ New
@@ @@
     private $user;
     private $password;
     private $database;
-    public function __construct(bool $useEnv = true)
+    public function __construct(bool $useEnv = false)
     {
         if (!$useEnv) {
             $this->setDefaultCredentials();

4) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Config\Database.php:57    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function connect()
     {
         try {
-            $conn = new \PDO("mysql:host={$this->host};dbname={$this->database}", $this->user, $this->password, array(\PDO::MYSQL_ATTR_INIT_COMMAND => "SET NAMES utf8"));
+            $conn = new \PDO("mysql:host={$this->host};dbname={$this->database}", $this->user, $this->password, array());
             $conn->setAttribute(\PDO::ATTR_ERRMODE, \PDO::ERRMODE_EXCEPTION);
             return $conn;
         } catch (\PDOException $e) {

5) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Config\Database.php:62    [M] Concat

--- Original
+++ New
@@ @@
             $conn->setAttribute(\PDO::ATTR_ERRMODE, \PDO::ERRMODE_EXCEPTION);
             return $conn;
         } catch (\PDOException $e) {
-            error_log("Error de conexión: " . $e->getMessage());
+            error_log($e->getMessage() . "Error de conexión: ");
             throw new DatabaseException("Error de conexión a la base de datos: " . $e->getMessage(), $e->getCode(), $e);
         }
     }
 }

6) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Config\Database.php:62    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $conn->setAttribute(\PDO::ATTR_ERRMODE, \PDO::ERRMODE_EXCEPTION);
             return $conn;
         } catch (\PDOException $e) {
-            error_log("Error de conexión: " . $e->getMessage());
+            error_log($e->getMessage());
             throw new DatabaseException("Error de conexión a la base de datos: " . $e->getMessage(), $e->getCode(), $e);
         }
     }
 }

9) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Config\Database.php:64    [M] Concat

--- Original
+++ New
@@ @@
             return $conn;
         } catch (\PDOException $e) {
             error_log("Error de conexión: " . $e->getMessage());
-            throw new DatabaseException("Error de conexión a la base de datos: " . $e->getMessage(), $e->getCode(), $e);
+            throw new DatabaseException($e->getMessage() . "Error de conexión a la base de datos: ", $e->getCode(), $e);
         }
     }
 }

10) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Config\Database.php:64    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             return $conn;
         } catch (\PDOException $e) {
             error_log("Error de conexión: " . $e->getMessage());
-            throw new DatabaseException("Error de conexión a la base de datos: " . $e->getMessage(), $e->getCode(), $e);
+            throw new DatabaseException($e->getMessage(), $e->getCode(), $e);
         }
     }
 }

11) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Config\Database.php:64    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             return $conn;
         } catch (\PDOException $e) {
             error_log("Error de conexión: " . $e->getMessage());
-            throw new DatabaseException("Error de conexión a la base de datos: " . $e->getMessage(), $e->getCode(), $e);
+            throw new DatabaseException("Error de conexión a la base de datos: ", $e->getCode(), $e);
         }
     }
 }
