[Survived] LogicalOr
Controllers/AdminController.php:240:13
     public function updateProduct($postData, $files) {
         try {
             // Validar que los datos no estén vacíos
-            if (empty($postData['update_p_id']) || 
-                empty($postData['update_name']) || 
-                empty($postData['update_price'])) {
+            if ((empty($postData['update_p_id']) || empty($postData['update_name'])) && empty($postData['update_price'])) {
                 return [
                     'success' => false, 

[Survived] LogicalOr
Controllers/AdminController.php:240:13
     public function updateProduct($postData, $files) {
         try {
             // Validar que los datos no estén vacíos
-            if (empty($postData['update_p_id']) || 
-                empty($postData['update_name']) || 
+            if (empty($postData['update_p_id']) && empty($postData['update_name']) || empty($postData['update_price'])) {
                 empty($postData['update_price'])) {
                 return [

[Killed] FalseValue
Controllers/AdminController.php:244:21
                 empty($postData['update_name']) || 
                 empty($postData['update_price'])) {
                 return [
-                    'success' => false, 
+                    return ['success' => true, 'message' => 'Datos del producto inválidos'];
                     'message' => 'Datos del producto inválidos'
                 ];
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateProductWithEmptyData
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:764

FAILURES!
Tests: 37, Assertions: 78, Failures: 1.

[Killed] FalseValue
Controllers/AdminController.php:252:21
             // Validar que el precio sea numérico
             if (!is_numeric($postData['update_price'])) {
                 return [
-                    'success' => false, 
+                    return ['success' => true, 'message' => 'Precio inválido'];
                     'message' => 'Precio inválido'
                 ];
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateProductWithInvalidPrice
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:797

FAILURES!
Tests: 38, Assertions: 82, Failures: 1.

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:296:13
             
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         } catch (\Exception $e) {
-            error_log("Error al actualizar producto: " . $e->getMessage());
+            error_log($e->getMessage());
             return [
                 'success' => false,

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:296:13
             
             return ['success' => false, 'message' => 'Error al actualizar el producto'];
         } catch (\Exception $e) {
-            error_log("Error al actualizar producto: " . $e->getMessage());
+            error_log("Error al actualizar producto: ");
             return [
                 'success' => false,

[Survived] FalseValue
Controllers/AdminController.php:298:17
         } catch (\Exception $e) {
             error_log("Error al actualizar producto: " . $e->getMessage());
             return [
-                'success' => false,
+                return ['success' => true, 'message' => 'Error al actualizar el producto'];
                 'message' => 'Error al actualizar el producto'
             ];

[Survived] MethodCallRemoval
Controllers/AdminController.php:349:13
             $stmt = $this->conn->prepare("UPDATE `orders` SET payment_status = ? WHERE id = ?");
             return $stmt->execute([$order->getPaymentStatus(), $order->getId()]);
         } catch (\PDOException $e) {
-            $this->handleDatabaseError($e);
+            
             return false;
         }

[Survived] FalseValue
Controllers/AdminController.php:350:13
             return $stmt->execute([$order->getPaymentStatus(), $order->getId()]);
         } catch (\PDOException $e) {
             $this->handleDatabaseError($e);
-            return false;
+            return true;
         }
     }
