[Killed] PublicVisibility
Controllers/AdminController.php:36:5
         return $data;
     }
 
-    public function getTotalPendings() {
+    protected function getTotalPendings()
         try {
             $stmt = $this->conn->prepare("SELECT * FROM `orders` WHERE payment_status = 'pendiente'");
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::obtener_total_pendientes_exitoso
Error: Call to protected method Controllers\AdminController::getTotalPendings() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:721

ERRORS!
Tests: 34, Assertions: 69, Errors: 1.

[Survived] FunctionCallRemoval
Controllers/AdminController.php:153:21
             if($image_data) {
                 $imagePath = self::UPLOAD_PATH . $image_data['image'];
                 if(file_exists($imagePath)) {
-                    unlink($imagePath);
+                    
                 }
             }

[Killed] Throw_
Controllers/AdminController.php:177:17
         try {
             // Validar el nombre del archivo
             if (empty($imageName) || !is_string($imageName)) {
-                throw new \Exception('Nombre de archivo inválido');
+                new \Exception('Nombre de archivo inválido');
             }
 
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePathWithEmptyAndNonStringName
TypeError: pathinfo(): Argument #1 ($path) must be of type string, array given

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:171
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControl

[Survived] Throw_
Controllers/AdminController.php:190:17
             $stmt = $this->conn->prepare("SELECT image FROM products WHERE image = ?");
             $stmt->execute([$imageName]);
             if (!$stmt->fetch()) {
-                throw new \Exception('Archivo no encontrado en la base de datos');
+                new \Exception('Archivo no encontrado en la base de datos');
             }
 

[Survived] ArrayItemRemoval
Controllers/AdminController.php:209:13
 
             // Verificar en la base de datos
             $stmt = $this->conn->prepare("SELECT image FROM products WHERE image = ? LIMIT 1");
-            $stmt->execute([$imageName]);
+            $stmt->execute([]);
             $result = $stmt->fetch(\PDO::FETCH_ASSOC);
 

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:217:13
             }
 
             // Construir y validar la ruta
-            $fullPath = realpath(self::UPLOAD_PATH . $result['image']);
+            $fullPath = realpath($result['image']);
             $uploadDir = realpath(self::UPLOAD_PATH);
 

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:256:17
 
                 // Generar nombre único para la nueva imagen
                 $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
-                $newImageName = uniqid() . '.' . $extension;
+                $newImageName = uniqid() . $extension;
                 $product->setImage($newImageName);
                 

[Survived] Concat
Controllers/AdminController.php:262:21
                 // Subir nueva imagen
                 move_uploaded_file(
                     $files['update_image']['tmp_name'], 
-                    self::UPLOAD_PATH . $newImageName
+                    move_uploaded_file($files['update_image']['tmp_name'], $newImageName . self::UPLOAD_PATH);
                 );
                 
