[Killed] Foreach_
Controllers/OrderController.php:104:13
             }
 
             // Validar productos antes de procesar
-            foreach($cartItems as $item) {
-                if(empty($item['name'])) {
-                    return ['success' => false, 'message' => 'Error: nombre de producto inválido'];
-                }
-                if($item['price'] < 0) {
-                    return ['success' => false, 'message' => 'Error: precio inválido'];
-                }
-            }
+            foreach (array() as $item) {
 
             // Calcular total y preparar lista de productos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido_con_total_negativo
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Error: precio inválido'
+'Error al procesar el pedido'

[Killed] FalseValue
Controllers/OrderController.php:106:21
             // Validar productos antes de procesar
             foreach($cartItems as $item) {
                 if(empty($item['name'])) {
-                    return ['success' => false, 'message' => 'Error: nombre de producto inválido'];
+                    return ['success' => true, 'message' => 'Error: nombre de producto inválido'];
                 }
                 if($item['price'] < 0) {
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido_con_nombre_producto_vacio
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:619

FAILURES!
Tests: 20, Assertions: 82, Failures: 1.

[Killed] LessThanNegotiation
Controllers/OrderController.php:108:17
                 if(empty($item['name'])) {
                     return ['success' => false, 'message' => 'Error: nombre de producto inválido'];
                 }
-                if($item['price'] < 0) {
+                if ($item['price'] >= 0) {
                     return ['success' => false, 'message' => 'Error: precio inválido'];
                 }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:65

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] LessThan
Controllers/OrderController.php:108:17
                 if(empty($item['name'])) {
                     return ['success' => false, 'message' => 'Error: nombre de producto inválido'];
                 }
-                if($item['price'] < 0) {
+                if ($item['price'] <= 0) {
                     return ['success' => false, 'message' => 'Error: precio inválido'];
                 }

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:117:17
             $cartTotal = 0;
             $products = [];
             foreach($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
+                $products[] = $item['name'] . ' (' . $item['quantity'];
                 $cartTotal += ($item['price'] * $item['quantity']);
             }

[Survived] Concat
Controllers/OrderController.php:117:17
             $cartTotal = 0;
             $products = [];
             foreach($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
+                $products[] = $item['name'] . ' (' . ')' . $item['quantity'];
                 $cartTotal += ($item['price'] * $item['quantity']);
             }

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:123:13
             $totalProducts = implode(', ', $products);
 
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . 
-                      $userData['street'] . ', ' . 
-                      $userData['city'] . ', ' . 
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
                       $userData['country'] . ' - ' . 
                       $userData['pin_code'];

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:123:13
             $totalProducts = implode(', ', $products);
 
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . 
-                      $userData['street'] . ', ' . 
-                      $userData['city'] . ', ' . 
-                      $userData['country'] . ' - ' . 
-                      $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ';
             
             // Establecer valores adicionales en el objeto Order

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:214:13
             }
             return $orders;
         } catch (\Exception $e) {
-            error_log("Error al obtener órdenes del usuario: " . $e->getMessage());
+            error_log($e->getMessage());
             return [];
         }

[Survived] Concat
Controllers/OrderController.php:214:13
             }
             return $orders;
         } catch (\Exception $e) {
-            error_log("Error al obtener órdenes del usuario: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al obtener órdenes del usuario: ");
             return [];
         }
