28) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:256    [M] Concat

--- Original
+++ New
@@ @@
                 }
                 // Generar nombre único para la nueva imagen
                 $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
-                $newImageName = uniqid() . '.' . $extension;
+                $newImageName = uniqid() . $extension . '.';
                 $product->setImage($newImageName);
                 // Subir nueva imagen
                 move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH . $newImageName);

29) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:256    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 }
                 // Generar nombre único para la nueva imagen
                 $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
-                $newImageName = uniqid() . '.' . $extension;
+                $newImageName = uniqid() . '.';
                 $product->setImage($newImageName);
                 // Subir nueva imagen
                 move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH . $newImageName);
